UWRobotRacing/RR-Hummingbot-Hardware/Firmware/hummingbot_firmware/Hummingbot_firmware/board/pin_mux.c
    /* PORTD11 (pin 35) is configured as LPUART2_CTS */
    PORT_SetPinMux(PORTD, 11U, kPORT_MuxAlt6);

    /* PORTD12 (pin 34) is configured as LPUART2_RTS */
    PORT_SetPinMux(PORTD, 12U, kPORT_MuxAlt6);

    /* PORTD13 (pin 25) is configured as FTM2_CH4 */
    PORT_SetPinMux(PORTD, 13U, kPORT_MuxAlt2);

    /* PORTD14 (pin 24) is configured as FTM2_CH5 */
    PORT_SetPinMux(PORTD, 14U, kPORT_MuxAlt2);

    /* PORTD15 (pin 22) is configured as ACMP2_IN1 */
    PORT_SetPinMux(PORTD, 15U, kPORT_PinDisabledOrAnalog);

    /* PORTD16 (pin 21) is configured as ACMP2_IN0 */
    PORT_SetPinMux(PORTD, 16U, kPORT_PinDisabledOrAnalog);

    /* PORTD17 (pin 20) is configured as LPUART2_RX */
    PORT_SetPinMux(PORTD, 17U, kPORT_MuxAlt3);

    /* PORTD2 (pin 71) is configured as ADC1_SE2 */
    PORT_SetPinMux(PORTD, 2U, kPORT_PinDisabledOrAnalog);

    /* PORTD3 (pin 70) is configured as ADC1_SE3 */
    PORT_SetPinMux(PORTD, 3U, kPORT_PinDisabledOrAnalog);

    /* PORTD4 (pin 69) is configured as ADC1_SE6 */
    PORT_SetPinMux(PORTD, 4U, kPORT_PinDisabledOrAnalog);

    /* PORTD5 (pin 33) is configured as PTD5 */
    PORT_SetPinMux(PORTD, 5U, kPORT_MuxAsGpio);

    /* PORTD6 (pin 32) is configured as PTD6 */
    PORT_SetPinMux(PORTD, 6U, kPORT_MuxAsGpio);

    /* PORTD7 (pin 31) is configured as PTD7 */
    PORT_SetPinMux(PORTD, 7U, kPORT_MuxAsGpio);

    /* PORTD8 (pin 42) is configured as LPI2C1_SDA */
    PORT_SetPinMux(PORTD, 8U, kPORT_MuxAlt2);

    /* PORTD9 (pin 41) is configured as LPI2C1_SCL */
    PORT_SetPinMux(PORTD, 9U, kPORT_MuxAlt2);

    /* PORTE0 (pin 94) is configured as LPSPI0_SCK */
    PORT_SetPinMux(PORTE, 0U, kPORT_MuxAlt2);

    /* PORTE1 (pin 93) is configured as LPSPI0_SIN */
    PORT_SetPinMux(PORTE, 1U, kPORT_MuxAlt2);

    /* PORTE10 (pin 6) is configured as FXIO_D4 */
    PORT_SetPinMux(PORTE, 10U, kPORT_MuxAlt6);

    /* PORTE11 (pin 5) is configured as FXIO_D5 */
    PORT_SetPinMux(PORTE, 11U, kPORT_MuxAlt6);

    /* PORTE12 (pin 19) is configured as LPUART2_TX */
    PORT_SetPinMux(PORTE, 12U, kPORT_MuxAlt3);

    /* PORTE13 (pin 7) is configured as PTE13 */
    PORT_SetPinMux(PORTE, 13U, kPORT_MuxAsGpio);

    /* PORTE14 (pin 17) is configured as ACMP2_IN3 */
    PORT_SetPinMux(PORTE, 14U, kPORT_PinDisabledOrAnalog);

    /* PORTE15 (pin 2) is configured as FXIO_D2 */
    PORT_SetPinMux(PORTE, 15U, kPORT_MuxAlt6);

    /* PORTE16 (pin 1) is configured as FXIO_D3 */
    PORT_SetPinMux(PORTE, 16U, kPORT_MuxAlt6);

    /* PORTE2 (pin 85) is configured as LPSPI0_SOUT */
    PORT_SetPinMux(PORTE, 2U, kPORT_MuxAlt2);

    /* PORTE3 (pin 18) is configured as ACMP2_OUT */
    PORT_SetPinMux(PORTE, 3U, kPORT_MuxAlt7);

    /* PORTE4 (pin 9) is configured as FTM2_QD_PHB */
    PORT_SetPinMux(PORTE, 4U, kPORT_MuxAlt3);

    /* PORTE5 (pin 8) is configured as FTM2_QD_PHA */
    PORT_SetPinMux(PORTE, 5U, kPORT_MuxAlt3);

    /* PORTE6 (pin 84) is configured as PTE6 */
    PORT_SetPinMux(PORTE, 6U, kPORT_MuxAsGpio);

    /* PORTE7 (pin 59) is configured as FTM0_CH7 */
    PORT_SetPinMux(PORTE, 7U, kPORT_MuxAlt2);

    /* PORTE8 (pin 26) is configured as ACMP0_IN3 */
    PORT_SetPinMux(PORTE, 8U, kPORT_PinDisabledOrAnalog);

    /* PORTE9 (pin 23) is configured as DAC0_OUT */
    PORT_SetPinMux(PORTE, 9U, kPORT_PinDisabledOrAnalog);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
